// // SЗадание 1. Совместная работа
// Задайте массив. Напишите программу, которая определяет, 
// присутствует ли заданное число в массиве. Программа должна выдать ответ: Да/Нет.
// Примеры
// [1 3 4 19 3], 8 => Нет [-4 3 4 1], 3 => Да
// Console.WriteLine("Hello, World!");

// Примеры массивов
// int[] array0 = new int[8];
// int[] array1 = new int[8] { 1, 2, 3, 4, 5, 6, 7, 8 };
// int[] array2 = new int[] { 1, 2, 3, 4, 5, 6, 7, 8 };


using System.ComponentModel.DataAnnotations;

// Console.WriteLine("Задайте целое число для поиска в массиве");
// int targetnum = Convert.ToInt32(Console.ReadLine());
// int[] array = { 5, 6, 7, 8, 9, 10 };
// bool res = false;

// for (int i = 0; i < array.Length; i++)
// {
//     if(array[i] == targetnum)
//     {
//         res = true;
//         break;

//     }
// }
// Console.WriteLine(res ? "да" : "нет");